app/controllers/api/measures_controller.rb

		def index
			measures = Measure.where(circuit_id: params[:circuit_id])
---
SELECT "measures".* FROM "measures" WHERE "measures"."circuit_id" = $1  [["circuit_id", 1]]

		def create
			measure = Measure.new(measure_params)
			parent_circuit = Circuit.find(params[:circuit_id])
			if measure.save
---
SELECT  "circuits".* FROM "circuits" WHERE "circuits"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "measures" ("circuit_id", "watts", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["circuit_id", 980190964], ["watts", 65], ["created_at", "2015-05-22 15:34:19.715272"], ["updated_at", "2015-05-22 15:34:19.715272"]]