app/views/circuits/show.html.erb

SELECT COUNT(*) FROM "measures" WHERE "measures"."circuit_id" = $1  [["circuit_id", 980190962]]
---
          <td class="numeric" data-title="Ultima medicion">
          	<% if @circuit.measures.count == 0 %>