app/controllers/circuits_controller.rb

  def create
    @circuit = Circuit.new(circuit_params)
    @circuit.type = params[:type]
    @circuit.user_id = current_user.id

    respond_to do |format|
      if @circuit.save
---
INSERT INTO "circuits" ("description", "alarm_time", "type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "MyText"], ["alarm_time", 5], ["type", "Demand"], ["created_at", "2015-07-22 20:54:39.731165"], ["updated_at", "2015-07-22 20:54:39.731165"]]

  def destroy
    @circuit.destroy
---
DELETE FROM "circuits" WHERE "circuits"."type" IN ('Demand') AND "circuits"."id" = $1  [["id", 980190962]]